tap "homebrew/bundle"
tap "homebrew/services"
tap "nikitabobko/tap"
tap "olets/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
cask "font-maple-mono"
# Web browser
cask "librewolf"
# Open-source code editor
cask "visual-studio-code"
vscode "aaron-bond.better-comments"
vscode "albert.tabout"
vscode "antfu.theme-vitesse"
vscode "asvetliakov.vscode-neovim"
vscode "catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "drcika.apc-extension"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "melishev.feather-vscode"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "oderwat.indent-rainbow"
vscode "qufiwefefwoyn.kanagawa"
vscode "ritwickdey.liveserver"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "thang-nm.catppuccin-perfect-icons"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vspacecode.whichkey"
vscode "xshrim.txt-syntax"
